#### [`repos`] Terraform Plan 📖`success`



<details><summary>Show Plan</summary>

```tf
data.github_team.cdktn-team-cdk-terrain: Reading...
data.github_team.cdktn-team-cdk-terrain: Read complete after 6s [id=15746607]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_actions_secret.cdktn-provider-archive_repo_secret-alert-prs-slack-webhook-url_3EAA76B3 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-alert-prs-slack-webhook-url_3EAA76B3" {
      ~ created_at       = "2026-01-11 15:25:09 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:09 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-gh-app-id-alias-PROJEN_APP_ID_42567B52 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-gh-app-id-alias-PROJEN_APP_ID_42567B52" {
      ~ created_at       = "2026-01-11 15:25:17 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:17 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-gh-app-id_B21F6EA0 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-gh-app-id_B21F6EA0" {
      ~ created_at       = "2026-01-11 15:25:22 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:22 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_5B0D44DC must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_5B0D44DC" {
      ~ created_at       = "2026-01-11 15:25:43 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:43 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-gh-app-private-key_1B91EF11 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-gh-app-private-key_1B91EF11" {
      ~ created_at       = "2026-01-11 15:25:20 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:20 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_044A657A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_044A657A" {
      ~ created_at       = "2026-01-15 05:27:29 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 05:27:29 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5CD9DE70 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5CD9DE70" {
      ~ created_at       = "2026-01-15 05:26:27 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 05:26:27 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-gh-token_BCE9E69C must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-gh-token_BCE9E69C" {
      ~ created_at       = "2026-01-15 05:26:13 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 05:26:13 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-npm-token_9A435341 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-npm-token_9A435341" {
      ~ created_at       = "2026-02-08 02:51:42 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-08 02:51:42 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-twine-password_F0BBCEF9 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-twine-password_F0BBCEF9" {
      ~ created_at       = "2026-02-02 17:51:30 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-02 17:51:30 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-archive_repo_secret-twine-username_3FB41B86 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-archive_repo_secret-twine-username_3FB41B86" {
      ~ created_at       = "2026-01-11 15:25:28 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-archive:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:28 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-alert-prs-slack-webhook-url_1F4B3133 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-alert-prs-slack-webhook-url_1F4B3133" {
      ~ created_at       = "2026-01-16 03:57:45 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-01-16 03:57:45 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-gh-app-id-alias-PROJEN_APP_ID_248425AD must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-gh-app-id-alias-PROJEN_APP_ID_248425AD" {
      ~ created_at       = "2026-01-16 03:57:24 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-16 03:57:24 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-gh-app-id_5C1C3B0A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-gh-app-id_5C1C3B0A" {
      ~ created_at       = "2026-01-16 03:57:20 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-16 03:57:20 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_D6EBC20D must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_D6EBC20D" {
      ~ created_at       = "2026-01-16 03:57:43 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-16 03:57:43 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-gh-app-private-key_F82B911E must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-gh-app-private-key_F82B911E" {
      ~ created_at       = "2026-01-16 03:57:37 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-16 03:57:37 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_BE1C067A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_BE1C067A" {
      ~ created_at       = "2026-01-16 03:57:13 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-16 03:57:13 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_EF4EA2F2 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_EF4EA2F2" {
      ~ created_at       = "2026-01-16 03:57:21 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-16 03:57:21 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-gh-token_4B61A244 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-gh-token_4B61A244" {
      ~ created_at       = "2026-01-16 03:57:15 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-16 03:57:15 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-npm-token_8361EB4A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-npm-token_8361EB4A" {
      ~ created_at       = "2026-02-08 02:51:48 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-08 02:51:48 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-twine-password_8580036B must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-twine-password_8580036B" {
      ~ created_at       = "2026-02-02 17:51:28 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-02 17:51:28 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-aws_repo_secret-twine-username_917EFB10 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-aws_repo_secret-twine-username_917EFB10" {
      ~ created_at       = "2026-01-16 03:57:31 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-aws:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-01-16 03:57:31 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-alert-prs-slack-webhook-url_3DEE0CCC must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-alert-prs-slack-webhook-url_3DEE0CCC" {
      ~ created_at       = "2026-02-07 11:10:43 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-02-07 11:10:43 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-app-id-alias-PROJEN_APP_ID_03A7C388 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-app-id-alias-PROJEN_APP_ID_03A7C388" {
      ~ created_at       = "2026-02-07 11:10:39 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-07 11:10:39 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-app-id_F3F7DE54 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-app-id_F3F7DE54" {
      ~ created_at       = "2026-02-07 11:10:42 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-07 11:10:42 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_B467195A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_B467195A" {
      ~ created_at       = "2026-02-07 11:10:41 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-07 11:10:41 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-app-private-key_728C9E43 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-app-private-key_728C9E43" {
      ~ created_at       = "2026-02-07 11:10:48 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-07 11:10:48 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_23459056 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_23459056" {
      ~ created_at       = "2026-02-07 11:10:38 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-07 11:10:38 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_34157FC4 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_34157FC4" {
      ~ created_at       = "2026-02-07 11:10:36 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-07 11:10:36 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-token_990262B8 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-token_990262B8" {
      ~ created_at       = "2026-02-07 11:10:35 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-07 11:10:35 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-npm-token_CBEF1300 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-npm-token_CBEF1300" {
      ~ created_at       = "2026-02-08 02:51:43 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-08 02:51:43 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-twine-password_F9423D0A must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-twine-password_F9423D0A" {
      ~ created_at       = "2026-02-07 11:10:37 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-07 11:10:37 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-twine-username_087C8662 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-twine-username_087C8662" {
      ~ created_at       = "2026-02-07 11:10:54 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-azurerm:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-02-07 11:10:54 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-alert-prs-slack-webhook-url_2D5F82FA must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-alert-prs-slack-webhook-url_2D5F82FA" {
      ~ created_at       = "2026-01-11 15:25:06 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:06 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-app-id-alias-PROJEN_APP_ID_2B2FE55F must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-gh-app-id-alias-PROJEN_APP_ID_2B2FE55F" {
      ~ created_at       = "2026-01-11 15:24:57 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:24:57 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-app-id_FC609807 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-gh-app-id_FC609807" {
      ~ created_at       = "2026-01-11 15:24:29 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:24:29 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_79D9AAB4 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_79D9AAB4" {
      ~ created_at       = "2026-01-11 15:25:01 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:01 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-app-private-key_C9777824 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-gh-app-private-key_C9777824" {
      ~ created_at       = "2026-01-11 15:25:00 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:00 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_B09BA867 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_B09BA867" {
      ~ created_at       = "2026-01-15 05:26:30 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 05:26:30 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_6E439A90 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_6E439A90" {
      ~ created_at       = "2026-01-15 05:27:17 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 05:27:17 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-token_6C4D33CF must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-gh-token_6C4D33CF" {
      ~ created_at       = "2026-01-15 05:26:56 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 05:26:56 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-npm-token_652B547F must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-npm-token_652B547F" {
      ~ created_at       = "2026-02-08 02:52:01 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-08 02:52:01 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-twine-password_95C843B1 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-twine-password_95C843B1" {
      ~ created_at       = "2026-02-02 17:51:31 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-02 17:51:31 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-cloudinit_repo_secret-twine-username_B3F38BF0 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-cloudinit_repo_secret-twine-username_B3F38BF0" {
      ~ created_at       = "2026-01-11 15:24:58 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-cloudinit:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:24:58 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-alert-prs-slack-webhook-url_7F1B7484 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-alert-prs-slack-webhook-url_7F1B7484" {
      ~ created_at       = "2026-01-11 15:27:24 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:27:24 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-gh-app-id-alias-PROJEN_APP_ID_6C6CBFC6 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-gh-app-id-alias-PROJEN_APP_ID_6C6CBFC6" {
      ~ created_at       = "2026-01-11 15:26:47 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:26:47 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-gh-app-id_D56D9346 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-gh-app-id_D56D9346" {
      ~ created_at       = "2026-01-11 15:27:23 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:27:23 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_A8AAD092 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_A8AAD092" {
      ~ created_at       = "2026-01-11 15:27:14 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:27:14 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-gh-app-private-key_1A5FE556 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-gh-app-private-key_1A5FE556" {
      ~ created_at       = "2026-01-11 15:26:57 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:26:57 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_FD3ABA72 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_FD3ABA72" {
      ~ created_at       = "2026-01-15 05:27:31 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 05:27:31 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_EDC8B29C must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_EDC8B29C" {
      ~ created_at       = "2026-01-15 05:27:13 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 05:27:13 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-gh-token_E88B7415 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-gh-token_E88B7415" {
      ~ created_at       = "2026-01-15 05:26:46 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 05:26:46 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-npm-token_DD40930E must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-npm-token_DD40930E" {
      ~ created_at       = "2026-02-08 02:51:40 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-08 02:51:40 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-twine-password_22A42B30 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-twine-password_22A42B30" {
      ~ created_at       = "2026-02-02 17:51:51 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-02 17:51:51 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-docker_repo_secret-twine-username_BE540D6B must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-docker_repo_secret-twine-username_BE540D6B" {
      ~ created_at       = "2026-01-11 15:26:55 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-docker:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:26:55 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-external_repo_secret-alert-prs-slack-webhook-url_BB647440 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-external_repo_secret-alert-prs-slack-webhook-url_BB647440" {
      ~ created_at       = "2026-01-11 15:25:50 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-external:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:25:50 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-external_repo_secret-gh-app-id-alias-PROJEN_APP_ID_8D15D30D must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-external_repo_secret-gh-app-id-alias-PROJEN_APP_ID_8D15D30D" {
      ~ created_at       = "2026-01-11 15:26:24 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-external:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:26:24 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-external_repo_secret-gh-app-id_99E659EE must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-external_repo_secret-gh-app-id_99E659EE" {
      ~ created_at       = "2026-01-11 15:26:16 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-external:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:26:16 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-external_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_377F81AA must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-external_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_377F81AA" {
      ~ created_at       = "2026-01-11 15:26:34 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-external:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:26:34 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-external_repo_secret-gh-app-private-key_D5692F82 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-external_repo_secret-gh-app-private-key_D5692F82" {
      ~ created_at       = "2026-01-11 15:26:00 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-external:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:26:00 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-external_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_A3BBBCD5 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-external_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_A3BBBCD5" {
      ~ created_at       = "2026-01-15 05:27:21 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-external:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 05:27:21 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-external_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_A078A8A5 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-external_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_A078A8A5" {
      ~ created_at       = "2026-01-15 05:26:25 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-external:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 05:26:25 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-external_repo_secret-gh-token_0E8824B7 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-external_repo_secret-gh-token_0E8824B7" {
      ~ created_at       = "2026-01-15 05:26:03 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-external:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 05:26:03 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-external_repo_secret-npm-token_320A2EF6 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-external_repo_secret-npm-token_320A2EF6" {
      ~ created_at       = "2026-02-08 02:51:46 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-external:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-08 02:51:46 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-external_repo_secret-twine-password_EC6F6175 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-external_repo_secret-twine-password_EC6F6175" {
      ~ created_at       = "2026-02-02 17:51:13 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-external:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-02 17:51:13 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-external_repo_secret-twine-username_AD14AA31 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-external_repo_secret-twine-username_AD14AA31" {
      ~ created_at       = "2026-01-11 15:26:11 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-external:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:26:11 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-github_repo_secret-alert-prs-slack-webhook-url_BE220BE0 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-github_repo_secret-alert-prs-slack-webhook-url_BE220BE0" {
      ~ created_at       = "2026-01-12 03:00:25 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-github:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-01-12 03:00:25 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-github_repo_secret-gh-app-id-alias-PROJEN_APP_ID_E92E2704 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-github_repo_secret-gh-app-id-alias-PROJEN_APP_ID_E92E2704" {
      ~ created_at       = "2026-01-12 03:00:30 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-github:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-12 03:00:30 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-github_repo_secret-gh-app-id_207FF949 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-github_repo_secret-gh-app-id_207FF949" {
      ~ created_at       = "2026-01-12 03:00:44 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-github:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-12 03:00:44 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-github_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_957A5DDF must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-github_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_957A5DDF" {
      ~ created_at       = "2026-01-12 03:00:22 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-github:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-12 03:00:22 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-github_repo_secret-gh-app-private-key_2B8A47BB must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-github_repo_secret-gh-app-private-key_2B8A47BB" {
      ~ created_at       = "2026-01-12 03:00:37 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-github:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-12 03:00:37 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-github_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_634E972C must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-github_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_634E972C" {
      ~ created_at       = "2026-01-15 05:26:50 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-github:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 05:26:50 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-github_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_DD70ECC4 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-github_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_DD70ECC4" {
      ~ created_at       = "2026-01-15 05:26:48 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-github:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 05:26:48 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-github_repo_secret-gh-token_173F27DC must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-github_repo_secret-gh-token_173F27DC" {
      ~ created_at       = "2026-01-15 05:26:22 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-github:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 05:26:22 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-github_repo_secret-npm-token_70F151CF must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-github_repo_secret-npm-token_70F151CF" {
      ~ created_at       = "2026-02-08 02:51:35 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-github:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-08 02:51:35 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-github_repo_secret-twine-password_4C2ED484 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-github_repo_secret-twine-password_4C2ED484" {
      ~ created_at       = "2026-02-02 17:51:27 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-github:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-02 17:51:27 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-github_repo_secret-twine-username_86A42CCA must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-github_repo_secret-twine-username_86A42CCA" {
      ~ created_at       = "2026-01-12 03:00:20 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-github:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-01-12 03:00:20 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-google_repo_secret-alert-prs-slack-webhook-url_AE5E2FD2 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-google_repo_secret-alert-prs-slack-webhook-url_AE5E2FD2" {
      ~ created_at       = "2026-02-07 12:17:42 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-google:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:42 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-google_repo_secret-gh-app-id-alias-PROJEN_APP_ID_9B83CA81 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-google_repo_secret-gh-app-id-alias-PROJEN_APP_ID_9B83CA81" {
      ~ created_at       = "2026-02-07 12:17:33 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-google:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:33 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-google_repo_secret-gh-app-id_8DEF5B35 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-google_repo_secret-gh-app-id_8DEF5B35" {
      ~ created_at       = "2026-02-07 12:17:37 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-google:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:37 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-google_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_46172A2D must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-google_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_46172A2D" {
      ~ created_at       = "2026-02-07 12:17:39 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-google:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:39 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-google_repo_secret-gh-app-private-key_A3F33FF3 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-google_repo_secret-gh-app-private-key_A3F33FF3" {
      ~ created_at       = "2026-02-07 12:17:51 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-google:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:51 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-google_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_1F05AEBA must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-google_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_1F05AEBA" {
      ~ created_at       = "2026-02-07 12:17:32 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-google:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:32 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-google_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_B0051816 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-google_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_B0051816" {
      ~ created_at       = "2026-02-07 12:17:53 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-google:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:53 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-google_repo_secret-gh-token_07A05D2D must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-google_repo_secret-gh-token_07A05D2D" {
      ~ created_at       = "2026-02-07 12:17:44 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-google:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:44 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-google_repo_secret-npm-token_29F3FEB6 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-google_repo_secret-npm-token_29F3FEB6" {
      ~ created_at       = "2026-02-08 02:52:02 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-google:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-08 02:52:02 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-google_repo_secret-twine-password_4A0EBB16 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-google_repo_secret-twine-password_4A0EBB16" {
      ~ created_at       = "2026-02-07 12:17:50 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-google:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:50 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-google_repo_secret-twine-username_EB033A1E must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-google_repo_secret-twine-username_EB033A1E" {
      ~ created_at       = "2026-02-07 12:17:43 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-google:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:43 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-googlebeta_repo_secret-alert-prs-slack-webhook-url_4998C8D8 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-googlebeta_repo_secret-alert-prs-slack-webhook-url_4998C8D8" {
      ~ created_at       = "2026-02-07 12:17:22 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-googlebeta:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:22 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-googlebeta_repo_secret-gh-app-id-alias-PROJEN_APP_ID_414A29E8 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-googlebeta_repo_secret-gh-app-id-alias-PROJEN_APP_ID_414A29E8" {
      ~ created_at       = "2026-02-07 12:17:26 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-googlebeta:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:26 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-googlebeta_repo_secret-gh-app-id_DDC66F4F must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-googlebeta_repo_secret-gh-app-id_DDC66F4F" {
      ~ created_at       = "2026-02-07 12:17:23 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-googlebeta:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:23 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-googlebeta_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_8B844473 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-googlebeta_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_8B844473" {
      ~ created_at       = "2026-02-07 12:17:06 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-googlebeta:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:06 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-googlebeta_repo_secret-gh-app-private-key_5BACD669 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-googlebeta_repo_secret-gh-app-private-key_5BACD669" {
      ~ created_at       = "2026-02-07 12:17:12 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-googlebeta:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:12 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-googlebeta_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_21A650A6 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-googlebeta_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_21A650A6" {
      ~ created_at       = "2026-02-07 12:17:21 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-googlebeta:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:21 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-googlebeta_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_FFECB311 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-googlebeta_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_FFECB311" {
      ~ created_at       = "2026-02-07 12:17:16 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-googlebeta:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:16 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-googlebeta_repo_secret-gh-token_3C6DF8E1 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-googlebeta_repo_secret-gh-token_3C6DF8E1" {
      ~ created_at       = "2026-02-07 12:17:05 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-googlebeta:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:05 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-googlebeta_repo_secret-npm-token_2117F6D7 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-googlebeta_repo_secret-npm-token_2117F6D7" {
      ~ created_at       = "2026-02-08 02:51:45 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-googlebeta:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-08 02:51:45 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-googlebeta_repo_secret-twine-password_978ADA38 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-googlebeta_repo_secret-twine-password_978ADA38" {
      ~ created_at       = "2026-02-07 12:17:10 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-googlebeta:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:10 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-googlebeta_repo_secret-twine-username_229DDB26 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-googlebeta_repo_secret-twine-username_229DDB26" {
      ~ created_at       = "2026-02-07 12:17:03 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-googlebeta:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-02-07 12:17:03 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-kubernetes_repo_secret-alert-prs-slack-webhook-url_6D7161A3 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-kubernetes_repo_secret-alert-prs-slack-webhook-url_6D7161A3" {
      ~ created_at       = "2026-01-15 06:46:37 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-kubernetes:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-01-15 06:46:37 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-kubernetes_repo_secret-gh-app-id-alias-PROJEN_APP_ID_2AD8C00B must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-kubernetes_repo_secret-gh-app-id-alias-PROJEN_APP_ID_2AD8C00B" {
      ~ created_at       = "2026-01-15 06:46:34 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-kubernetes:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-15 06:46:34 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-kubernetes_repo_secret-gh-app-id_8F887D67 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-kubernetes_repo_secret-gh-app-id_8F887D67" {
      ~ created_at       = "2026-01-15 06:46:08 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-kubernetes:GH_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-15 06:46:08 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-kubernetes_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_4B6A1180 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-kubernetes_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_4B6A1180" {
      ~ created_at       = "2026-01-15 06:46:35 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-kubernetes:PROJEN_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-15 06:46:35 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-kubernetes_repo_secret-gh-app-private-key_2927BDC8 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-kubernetes_repo_secret-gh-app-private-key_2927BDC8" {
      ~ created_at       = "2026-01-15 06:46:16 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-kubernetes:GH_APP_PRIVATE_KEY" -> (known after apply)
      ~ updated_at       = "2026-01-15 06:46:16 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-kubernetes_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_A4AE1085 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-kubernetes_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_A4AE1085" {
      ~ created_at       = "2026-01-15 06:46:10 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-kubernetes:GO_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 06:46:10 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-kubernetes_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5384DEBE must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-kubernetes_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5384DEBE" {
      ~ created_at       = "2026-01-15 06:46:14 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-kubernetes:PROJEN_GITHUB_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 06:46:14 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-kubernetes_repo_secret-gh-token_C92D2ADC must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-kubernetes_repo_secret-gh-token_C92D2ADC" {
      ~ created_at       = "2026-01-15 06:46:13 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-kubernetes:GH_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-01-15 06:46:13 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-kubernetes_repo_secret-npm-token_ED15FB55 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-kubernetes_repo_secret-npm-token_ED15FB55" {
      ~ created_at       = "2026-02-08 02:51:37 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-kubernetes:NPM_TOKEN" -> (known after apply)
      ~ updated_at       = "2026-02-08 02:51:37 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-kubernetes_repo_secret-twine-password_5B309626 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-kubernetes_repo_secret-twine-password_5B309626" {
      ~ created_at       = "2026-02-02 17:51:44 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-kubernetes:TWINE_PASSWORD" -> (known after apply)
      ~ updated_at       = "2026-02-02 17:51:44 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-kubernetes_repo_secret-twine-username_B2AFC50B must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-kubernetes_repo_secret-twine-username_B2AFC50B" {
      ~ created_at       = "2026-01-15 06:46:24 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-kubernetes:TWINE_USERNAME" -> (known after apply)
      ~ updated_at       = "2026-01-15 06:46:24 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-local_repo_secret-alert-prs-slack-webhook-url_EE4858D3 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-local_repo_secret-alert-prs-slack-webhook-url_EE4858D3" {
      ~ created_at       = "2026-01-11 15:48:31 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-local:ALERT_PRS_SLACK_WEBHOOK_URL" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:48:31 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-local_repo_secret-gh-app-id-alias-PROJEN_APP_ID_9A08252D must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-local_repo_secret-gh-app-id-alias-PROJEN_APP_ID_9A08252D" {
      ~ created_at       = "2026-01-11 15:48:47 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "cdktn-provider-local:PROJEN_APP_ID" -> (known after apply)
      ~ updated_at       = "2026-01-11 15:48:47 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.cdktn-provider-local_repo_secret-gh-app-id_48B58B53 must be replaced
-/+ resource "github_actions_secret" "cdktn-provider-local_repo_secret-gh-app-id_48B58B53...
```

</details>

*Pusher: @team-cdk-terrain[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*